# FabricationRodInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationRodInfo Properties
FabricationRodInfo Class See Also
---
The FabricationRodInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanRodsBeHosted | Controls whether the hanger's rod's will be automatically hosted by other elements. |
| IsAttachedToStructure | Checks if the hanger is attached to structure. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| RodCount | Gets the number of rods. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace